Fabric Area is sketched completely outside of its host.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FabricAreaOutSideOfHost { get; }
  Visual Basic
Public Shared ReadOnly Property FabricAreaOutSideOfHost As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FabricAreaOutSideOfHost {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FabricAreaFailures Class
  Autodesk.Revit.DB Namespace